doc/Doxygen/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Building the Doxygen help for OpenFOAM</title>
<!-- 2016-06-18 Sat 10:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Building the Doxygen help for OpenFOAM</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Doxygen</a></li>
<li><a href="#sec-2">2. Configuration</a></li>
<li><a href="#sec-3">3. Running Doxygen</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Doxygen</h2>
<div class="outline-text-2" id="text-1">
<p>
The HTML documentation of OpenFOAM can be built using the Doxygen software.
Images in the documentation are generated using "dot", a program within the
graphviz software package.  To build the documentation on the Ubuntu GNU/Linux
system, for example, the user should install both <code>doxygen</code> and <code>graphviz</code>
packages, e.g. by typing in a terminal window:
</p>
<ul class="org-ul">
<li><code>sudo apt-get install doxygen graphviz</code>
</li>
</ul>

<p>
The Doxygen documentation will build automatically for a user that is
configured to run OpenFOAM, i.e. has environment variables such as
<code>$WM_PROJECT_DIR</code> set.  The user must also ensure they have write
permission for the directory that Doxygen writes files to.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Configuration</h2>
<div class="outline-text-2" id="text-2">
<p>
The Doygen configuration file, Doxyfile, in the <code>$WM_PROJECT_DIR/doc/Doxygen</code>
directory is configured to work with Doxygen versions 1.6.3-1.8.5.
</p>

<p>
The Header, Footer, and Stylesheet are generated automatically:
</p>
<ul class="org-ul">
<li><code>doxygen -w html header.html footer.html customdoxygen.css</code>
</li>
</ul>

<p>
See: <a href="https://www.stack.nl/~dimitri/doxygen/manual/customize.html">https://www.stack.nl/~dimitri/doxygen/manual/customize.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Running Doxygen</h2>
<div class="outline-text-2" id="text-3">
<p>
In the <code>$WM_PROJECT_DIR/doc/Doxygen</code> directory type
</p>
<ul class="org-ul">
<li><code>./Allwmake</code>
</li>
</ul>

<p>
which will generate the <code>$WM_PROJECT_DIR/doc/Doxygen/html</code> directory
containing the OpenFOAM source code documentation.  Load the <code>index.html</code> file
into a browser, <i>e.g.</i>
</p>
<ul class="org-ul">
<li><code>firefox $WM_PROJECT_DIR/doc/Doxygen/html/index.html</code>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 18th June 2016</p>
<p class="date">Created: 2016-06-18 Sat 10:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
